src/test/jmeter/wordsapp_load_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="WordsApp Load Test" enabled="true">
      <stringProp name="TestPlan.comments">Load Test for WordsApp API</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" testclass="Arguments" guiclass="ArgumentsPanel" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Auth Load Test" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" testclass="LoopController" guiclass="LoopControlPanel" testname="Loop Controller">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">100</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpSampleGUI" testclass="HTTPSamplerProxy" testname="Register User" enabled="true">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.path">/api/auth/register</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <stringProp name="HTTPSampler.content_type">application/json</stringProp>
          <stringProp name="HTTPSampler.postBodyRaw">{"username":"testuser_${__Random(1,1000)}","password":"password123"}</stringProp>
        </HTTPSamplerProxy>
      </hashTree>
      
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Word API Load Test" enabled="true">
        <stringProp name="ThreadGroup.num_threads">20</stringProp>
        <stringProp name="ThreadGroup.ramp_time">20</stringProp>
        <stringProp name="ThreadGroup.duration">60</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpSampleGUI" testclass="HTTPSamplerProxy" testname="Get Word Meaning" enabled="true">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.path">/api/word</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <stringProp name="HTTPSampler.content_type">application/json</stringProp>
        </HTTPSamplerProxy>
      </hashTree>
      
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Dialog API Load Test" enabled="true">
        <stringProp name="ThreadGroup.num_threads">15</stringProp>
        <stringProp name="ThreadGroup.ramp_time">15</stringProp>
        <stringProp name="ThreadGroup.duration">60</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpSampleGUI" testclass="HTTPSamplerProxy" testname="Send Dialog Message" enabled="true">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.path">/api/dialog/message</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
      </hashTree>
      
      <SummaryReporter guiclass="SummaryReporter" testclass="SummaryReporter" testname="Summary Report">
        <boolProp name="SummaryReporter.include_group_name">true</boolProp>
      </SummaryReporter>
    </hashTree>
  </hashTree>
</jmeterTestPlan>